package edu.tl.java4;
/**
 * 1.什么是数组？
 * 	数组是有序数据的集合。
 * 2.由于数组中所有元素都具有相同的数据类型。因此，在一个数组中，数组元素的类型是唯一的，
 * 即一个数组里只能存储一种数据类型的数据，而不能存储多种类型的数据。
 * 3.一旦完成了数组的初始化工作，数组在内存中所占空间将被固定下来。因此数组的长度不可改变。
 * 即使把数组所有元素的数据都清空，数组所占空间依然被保留，数组的长度依然不变。
 * 4.java数组既可以存储基本类型数据，也可以存储引用类型数据，只要数组的所有元素都具有相同的类型即可。
 * 5.数组本身就是一数据类型，它本身就是一种引用类型。
 * 
 * **/

/**
 * 1.使用数组时，首先要声明和初始化数组，否则就不能使用数组。
 * 2.声明数组：
 * 	（java支持两种语法格式来声明数组，声明数组时不能指定数组的长度。）
 * 	1.数组类型[] 数组名;
 * 	2.数组类型	数组名[];
 * 3.数组初始化：
 * 	1.静态初始化：
 * 		数组名=new 数组类型[]{元素值1,元素值2,元素值3,.....,元素值n}
 * 		数据类型  数组名[]={元素值1,元素值2,元素值3,....元素n}
 * 	2.动态初始化：java4_4.java
 * **/
public class java4_2 {
	
	public void Array1(){
		int[] array1;
		array1=new int[]{99,54,44,55,44,65,57,69,70,78};
		char[] array2;
		array2=new char[]{'东','南','西','北','中'};
		int[] iArray={23,33,34,56,76,88,98,70,65};
		String[] sArray={"比尔盖茨","乔布斯","扎克伯格"};
	}
	public static void main(String[] args) {
		

	}

}
